[Timeout] BlockStatement
app/utils/calculation/calculation.ts:23:60
 
 const isNilOrEmpty = either(isNil, isEmpty);
 
-const getFlightType = (duration: number): TransportType => {
-  /* Below 3 hours */
-  if (duration < 180) {
-    return TransportType.shortHaulFlight;
-  }
-
-  /* Between 3 and 6 hours */
-  if (duration < 360) {
-    return TransportType.mediumHaulFlight;
-  }
-
-  /* Above 6 hours */
-  return TransportType.longHaulFlight;
-};
+const getFlightType = (duration: number): TransportType => {};
 
 const getFlightEmissionValue = (duration: number): number => {

[Killed] BlockStatement
app/utils/calculation/calculation.ts:25:23
 
 const getFlightType = (duration: number): TransportType => {
   /* Below 3 hours */
-  if (duration < 180) {
-    return TransportType.shortHaulFlight;
-  }
+  if (duration < 180) {}
 
   /* Between 3 and 6 hours */
killedBy: getFlightType should return the correct flight type for a short flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "shortHaulFlight"
Received: "mediumHaulFlight"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:25:7
 
 const getFlightType = (duration: number): TransportType => {
   /* Below 3 hours */
-  if (duration < 180) {
+  if (false) {
     return TransportType.shortHaulFlight;
   }
killedBy: getFlightType should return the correct flight type for a short flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "shortHaulFlight"
Received: "mediumHaulFlight"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:30:7
   }
 
   /* Between 3 and 6 hours */
-  if (duration < 360) {
+  if (true) {
     return TransportType.mediumHaulFlight;
   }
killedBy: getFlightType should return the correct flight type for a boundary long flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "longHaulFlight"
Received: "mediumHaulFlight"

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:30:7
   }
 
   /* Between 3 and 6 hours */
-  if (duration < 360) {
+  if (duration >= 360) {
     return TransportType.mediumHaulFlight;
   }
killedBy: getFlightType should return the correct flight type for a boundary medium flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "mediumHaulFlight"
Received: "longHaulFlight"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:40:5
 
 const getFlightEmissionValue = (duration: number): number => {
   switch (getFlightType(duration)) {
-    case TransportType.shortHaulFlight: {
-      /* Paris -> Toulouse 1h15 AF6122 588 km */
-      /* Paris -> Stockholm 2h35 AF1462 1543 km */
-      const averageSpeedShortHaulSpeed =
-        ((588 * 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
-      return averageSpeedShortHaulSpeed * duration;
-    }
+    case TransportType.shortHaulFlight:
     case TransportType.mediumHaulFlight: {
       /* Paris -> Istanbul 3h25 AF1390 2255 km */
killedBy: getFlightEmissionValue should return the correct emission value for a short flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 533845.1612903225
Received: 695652.1739130435

[Killed] BlockStatement
app/utils/calculation/calculation.ts:40:41
 
 const getFlightEmissionValue = (duration: number): number => {
   switch (getFlightType(duration)) {
-    case TransportType.shortHaulFlight: {
-      /* Paris -> Toulouse 1h15 AF6122 588 km */
-      /* Paris -> Stockholm 2h35 AF1462 1543 km */
-      const averageSpeedShortHaulSpeed =
-        ((588 * 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
-      return averageSpeedShortHaulSpeed * duration;
-    }
+    case TransportType.shortHaulFlight: {}
     case TransportType.mediumHaulFlight: {
       /* Paris -> Istanbul 3h25 AF1390 2255 km */
killedBy: getFlightEmissionValue should return the correct emission value for a short flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 533845.1612903225
Received: 695652.1739130435

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:44:11
       /* Paris -> Toulouse 1h15 AF6122 588 km */
       /* Paris -> Stockholm 2h35 AF1462 1543 km */
       const averageSpeedShortHaulSpeed =
-        ((588 * 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
+        ((588 / 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
       return averageSpeedShortHaulSpeed * duration;
     }
killedBy: getFlightEmissionValue should return the correct emission value for a short flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 533845.1612903225
Received: 298645.39649032254

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:44:37
       /* Paris -> Toulouse 1h15 AF6122 588 km */
       /* Paris -> Stockholm 2h35 AF1462 1543 km */
       const averageSpeedShortHaulSpeed =
-        ((588 * 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
+        ((588 * 1000) / (60 + 15) + 1543 * 1000 * (2 * 60 + 35)) / 2;
       return averageSpeedShortHaulSpeed * duration;
     }
killedBy: getFlightEmissionValue should return the correct emission value for a short flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 533845.1612903225
Received: 7175185200

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:45:14
       /* Paris -> Stockholm 2h35 AF1462 1543 km */
       const averageSpeedShortHaulSpeed =
         ((588 * 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
-      return averageSpeedShortHaulSpeed * duration;
+      return averageSpeedShortHaulSpeed / duration;
     }
     case TransportType.mediumHaulFlight: {
killedBy: getFlightEmissionValue should return the correct emission value for a short flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 533845.1612903225
Received: 148.29032258064515

[Killed] BlockStatement
app/utils/calculation/calculation.ts:47:42
         ((588 * 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
       return averageSpeedShortHaulSpeed * duration;
     }
-    case TransportType.mediumHaulFlight: {
-      /* Paris -> Istanbul 3h25 AF1390 2255 km */
-      /* Paris -> Dakar 5h45 AF718 4205 km */
-      const averageMediumHaulSpeed =
-        ((2255 * 1000) / (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
-      return averageMediumHaulSpeed * duration;
-    }
+    case TransportType.mediumHaulFlight: {}
     case TransportType.longHaulFlight: {
       /* Paris -> New York 8h15 AF22 5837 km */
killedBy: getFlightEmissionValue should return the correct emission value for a medium flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2782608.695652174
Received: 3021650.992685476

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:47:5
         ((588 * 1000) / (60 + 15) + (1543 * 1000) / (2 * 60 + 35)) / 2;
       return averageSpeedShortHaulSpeed * duration;
     }
-    case TransportType.mediumHaulFlight: {
-      /* Paris -> Istanbul 3h25 AF1390 2255 km */
-      /* Paris -> Dakar 5h45 AF718 4205 km */
-      const averageMediumHaulSpeed =
-        ((2255 * 1000) / (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
-      return averageMediumHaulSpeed * duration;
-    }
+    case TransportType.mediumHaulFlight:
     case TransportType.longHaulFlight: {
       /* Paris -> New York 8h15 AF22 5837 km */
killedBy: getFlightEmissionValue should return the correct emission value for a medium flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2782608.695652174
Received: 3021650.992685476

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:51:10
       /* Paris -> Istanbul 3h25 AF1390 2255 km */
       /* Paris -> Dakar 5h45 AF718 4205 km */
       const averageMediumHaulSpeed =
-        ((2255 * 1000) / (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
+        (2255 * 1000 * (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
       return averageMediumHaulSpeed * duration;
     }
killedBy: getFlightEmissionValue should return the correct emission value for a medium flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2782608.695652174
Received: 55474462608.695656

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:51:42
       /* Paris -> Istanbul 3h25 AF1390 2255 km */
       /* Paris -> Dakar 5h45 AF718 4205 km */
       const averageMediumHaulSpeed =
-        ((2255 * 1000) / (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
+        ((2255 * 1000) / (3 * 60 + 25) + 4205 * 1000 * (5 * 60 + 45)) / 2;
       return averageMediumHaulSpeed * duration;
     }
killedBy: getFlightEmissionValue should return the correct emission value for a medium flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2782608.695652174
Received: 174088320000

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:52:14
       /* Paris -> Dakar 5h45 AF718 4205 km */
       const averageMediumHaulSpeed =
         ((2255 * 1000) / (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
-      return averageMediumHaulSpeed * duration;
+      return averageMediumHaulSpeed / duration;
     }
     case TransportType.longHaulFlight: {
killedBy: getFlightEmissionValue should return the correct emission value for a medium flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2782608.695652174
Received: 48.30917874396135

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:54:5
         ((2255 * 1000) / (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
       return averageMediumHaulSpeed * duration;
     }
-    case TransportType.longHaulFlight: {
-      /* Paris -> New York 8h15 AF22 5837 km */
-      /* Paris -> Santiago 14h30 AF406 11648 km */
-      const averageLongHaulSpeed =
-        ((5837 * 1000) / (8 * 60 + 15) + (11648 * 1000) / (14 * 60 + 30)) / 2;
-      return averageLongHaulSpeed * duration;
-    }
+    case TransportType.longHaulFlight:
     default:
       return 0;
killedBy: getFlightEmissionValue should return the correct emission value for a long flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6043301.985370952
Received: 0

[Killed] BlockStatement
app/utils/calculation/calculation.ts:54:40
         ((2255 * 1000) / (3 * 60 + 25) + (4205 * 1000) / (5 * 60 + 45)) / 2;
       return averageMediumHaulSpeed * duration;
     }
-    case TransportType.longHaulFlight: {
-      /* Paris -> New York 8h15 AF22 5837 km */
-      /* Paris -> Santiago 14h30 AF406 11648 km */
-      const averageLongHaulSpeed =
-        ((5837 * 1000) / (8 * 60 + 15) + (11648 * 1000) / (14 * 60 + 30)) / 2;
-      return averageLongHaulSpeed * duration;
-    }
+    case TransportType.longHaulFlight: {}
     default:
       return 0;
killedBy: getFlightEmissionValue should return the correct emission value for a long flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6043301.985370952
Received: 0

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:58:9
       /* Paris -> New York 8h15 AF22 5837 km */
       /* Paris -> Santiago 14h30 AF406 11648 km */
       const averageLongHaulSpeed =
-        ((5837 * 1000) / (8 * 60 + 15) + (11648 * 1000) / (14 * 60 + 30)) / 2;
+        (5837 * 1000 / (8 * 60 + 15) + 11648 * 1000 / (14 * 60 + 30)) * 2;
       return averageLongHaulSpeed * duration;
     }
killedBy: getFlightEmissionValue should return the correct emission value for a long flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6043301.985370952
Received: 24173207.941483807

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:58:27
       /* Paris -> New York 8h15 AF22 5837 km */
       /* Paris -> Santiago 14h30 AF406 11648 km */
       const averageLongHaulSpeed =
-        ((5837 * 1000) / (8 * 60 + 15) + (11648 * 1000) / (14 * 60 + 30)) / 2;
+        ((5837 * 1000) / (8 * 60 - 15) + (11648 * 1000) / (14 * 60 + 30)) / 2;
       return averageLongHaulSpeed * duration;
     }
killedBy: getFlightEmissionValue should return the correct emission value for a long flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6043301.985370952
Received: 6225886.540600668

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:59:14
       /* Paris -> Santiago 14h30 AF406 11648 km */
       const averageLongHaulSpeed =
         ((5837 * 1000) / (8 * 60 + 15) + (11648 * 1000) / (14 * 60 + 30)) / 2;
-      return averageLongHaulSpeed * duration;
+      return averageLongHaulSpeed / duration;
     }
     default:
killedBy: getFlightEmissionValue should return the correct emission value for a long flight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6043301.985370952
Received: 26.229609311505865

[NoCoverage] ConditionalExpression
app/utils/calculation/calculation.ts:61:5
         ((5837 * 1000) / (8 * 60 + 15) + (11648 * 1000) / (14 * 60 + 30)) / 2;
       return averageLongHaulSpeed * duration;
     }
-    default:
-      return 0;
+    default:
   }
 };

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:68:5
 
 const getC02ValueFromEmission = (emission: Emission | RecurringEmission): number => {
   if (
-    emission.emissionType === EmissionType.custom ||
-    emission.emissionType === EmissionType.productScanned
+    false
   ) {
     return emission.value;
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for custom emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: NaN

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:68:5
 
 const getC02ValueFromEmission = (emission: Emission | RecurringEmission): number => {
   if (
-    emission.emissionType === EmissionType.custom ||
+    false ||
     emission.emissionType === EmissionType.productScanned
   ) {
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for custom emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: NaN

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:69:5
 const getC02ValueFromEmission = (emission: Emission | RecurringEmission): number => {
   if (
     emission.emissionType === EmissionType.custom ||
-    emission.emissionType === EmissionType.productScanned
+    false
   ) {
     return emission.value;
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for product scanned emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: NaN

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:69:5
 const getC02ValueFromEmission = (emission: Emission | RecurringEmission): number => {
   if (
     emission.emissionType === EmissionType.custom ||
-    emission.emissionType === EmissionType.productScanned
+    emission.emissionType !== EmissionType.productScanned
   ) {
     return emission.value;
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for food emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: 10

[Killed] BlockStatement
app/utils/calculation/calculation.ts:70:5
   if (
     emission.emissionType === EmissionType.custom ||
     emission.emissionType === EmissionType.productScanned
-  ) {
-    return emission.value;
-  }
+  ) {}
 
   if (emission.emissionType === EmissionType.electricity) {
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for custom emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: NaN

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:74:7
     return emission.value;
   }
 
-  if (emission.emissionType === EmissionType.electricity) {
+  if (true) {
     return emission.value * electricity[emission.emissionModelType];
   }
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for food emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: NaN

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:74:7
     return emission.value;
   }
 
-  if (emission.emissionType === EmissionType.electricity) {
+  if (emission.emissionType !== EmissionType.electricity) {
     return emission.value * electricity[emission.emissionModelType];
   }
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for food emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: NaN

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:75:12
   }
 
   if (emission.emissionType === EmissionType.electricity) {
-    return emission.value * electricity[emission.emissionModelType];
+    return emission.value / electricity[emission.emissionModelType];
   }
 
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for electricity emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 9.722222222222222e-8
Received: 1028571428.5714285

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:78:7
     return emission.value * electricity[emission.emissionModelType];
   }
 
-  if (emission.emissionType === EmissionType.streaming) {
+  if (emission.emissionType !== EmissionType.streaming) {
     return getInternetUsageCarbonImpact(
       emission.value,
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for food emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: NaN

[Killed] BlockStatement
app/utils/calculation/calculation.ts:78:57
     return emission.value * electricity[emission.emissionModelType];
   }
 
-  if (emission.emissionType === EmissionType.streaming) {
-    return getInternetUsageCarbonImpact(
-      emission.value,
-      streaming[emission.emissionModelType] * emission.value,
-      emission.location || ElectricityType.world
-    );
-  }
+  if (emission.emissionType === EmissionType.streaming) {}
 
   const model = {
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for streaming emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.00009832670187793425
Received: NaN

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:81:7
   if (emission.emissionType === EmissionType.streaming) {
     return getInternetUsageCarbonImpact(
       emission.value,
-      streaming[emission.emissionModelType] * emission.value,
+      streaming[emission.emissionModelType] / emission.value,
       emission.location || ElectricityType.world
     );
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for streaming emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.00009832670187793425
Received: 0.00005089576701877933

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:82:7
     return getInternetUsageCarbonImpact(
       emission.value,
       streaming[emission.emissionModelType] * emission.value,
-      emission.location || ElectricityType.world
+      true
     );
   }
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for streaming emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.00009832670187793425
Received: NaN

[Killed] LogicalOperator
app/utils/calculation/calculation.ts:82:7
     return getInternetUsageCarbonImpact(
       emission.value,
       streaming[emission.emissionModelType] * emission.value,
-      emission.location || ElectricityType.world
+      emission.location && ElectricityType.world
     );
   }
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for streaming emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.00009832670187793425
Received: 0.00012720170187793424

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:93:10
     ...fashion,
     ...meal,
   };
-  return emission.value * model[emission.emissionModelType];
+  return emission.value / model[emission.emissionModelType];
 };
 
killedBy: getC02ValueFromEmission should return the correct co2 emitted value for food emission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: 5

[Killed] ArrowFunction
app/utils/calculation/calculation.ts:98:27
 
 const getCreationDate: (Emission) => string = prop("creationDate");
 
-const getLatestEmission = (emissions: Array<Emission>): Emission =>
-  isNilOrEmpty(emissions) ? null : reduce(maxBy(getCreationDate), emissions[0], emissions);
+const getLatestEmission = () => undefined;
 
 const toKWH = (x: number): number => (x * 3.6) / Math.pow(10, -6);
killedBy: getLatestEmission should return the latest emission emitted if no emissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: null
Received: undefined

[Killed] UnaryOperator
app/utils/calculation/calculation.ts:101:63
 const getLatestEmission = (emissions: Array<Emission>): Emission =>
   isNilOrEmpty(emissions) ? null : reduce(maxBy(getCreationDate), emissions[0], emissions);
 
-const toKWH = (x: number): number => (x * 3.6) / Math.pow(10, -6);
+const toKWH = (x: number): number => (x * 3.6) / Math.pow(10, +6);
 const toKgCO2 = (x: number): number => x * 1000;
 const getCarbonIntensityInGramPerKWHromKgPerJoules = pipe(toKWH, toKgCO2, Math.round);
killedBy: getCarbonIntensityInGramPerKWHromKgPerJoules should convert data from kgCO2/J to gCO2/kWh if no emissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 35
Received: 0

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:101:39
 const getLatestEmission = (emissions: Array<Emission>): Emission =>
   isNilOrEmpty(emissions) ? null : reduce(maxBy(getCreationDate), emissions[0], emissions);
 
-const toKWH = (x: number): number => (x * 3.6) / Math.pow(10, -6);
+const toKWH = (x: number): number => (x / 3.6) / Math.pow(10, -6);
 const toKgCO2 = (x: number): number => x * 1000;
 const getCarbonIntensityInGramPerKWHromKgPerJoules = pipe(toKWH, toKgCO2, Math.round);
killedBy: getCarbonIntensityInGramPerKWHromKgPerJoules should convert data from kgCO2/J to gCO2/kWh if no emissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 35
Received: 3

[Killed] ArrowFunction
app/utils/calculation/calculation.ts:102:17
   isNilOrEmpty(emissions) ? null : reduce(maxBy(getCreationDate), emissions[0], emissions);
 
 const toKWH = (x: number): number => (x * 3.6) / Math.pow(10, -6);
-const toKgCO2 = (x: number): number => x * 1000;
+const toKgCO2 = () => undefined;
 const getCarbonIntensityInGramPerKWHromKgPerJoules = pipe(toKWH, toKgCO2, Math.round);
 
killedBy: getCarbonIntensityInGramPerKWHromKgPerJoules should convert data from kgCO2/J to gCO2/kWh if no emissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 35
Received: NaN

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:102:40
   isNilOrEmpty(emissions) ? null : reduce(maxBy(getCreationDate), emissions[0], emissions);
 
 const toKWH = (x: number): number => (x * 3.6) / Math.pow(10, -6);
-const toKgCO2 = (x: number): number => x * 1000;
+const toKgCO2 = (x: number): number => x / 1000;
 const getCarbonIntensityInGramPerKWHromKgPerJoules = pipe(toKWH, toKgCO2, Math.round);
 
killedBy: getCarbonIntensityInGramPerKWHromKgPerJoules should convert data from kgCO2/J to gCO2/kWh if no emissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 35
Received: 0

[Killed] BlockStatement
app/utils/calculation/calculation.ts:115:14
   weekDays: Array<WeekDays>;
 }): string => {
   let periodicityText = "";
-  if (times) {
-    if (periodType == PeriodicityType.monthly) {
-      periodicityText = t("UI_MONTHLY");
-    } else {
-      periodicityText = t("UI_WEEKLY");
-    }
-    periodicityText = periodicityText + " - ";
-
-    if (times > 1) {
-      periodicityText = periodicityText + times + " " + t("UI_TIMES");
-    } else {
-      periodicityText = periodicityText + times + " " + t("UI_TIME");
-    }
-
-    if (weekDays.length) {
-      periodicityText = periodicityText + " " + t("UI_EVERY") + " ";
-      const daysToDisplay = WEEK_DAYS.filter((item) =>
-        weekDays.includes(item.dayIndex)
-      ).map((item) => t(item.nameKey));
-      periodicityText = periodicityText + join(", ", daysToDisplay);
-    }
-  }
+  if (times) {}
   return periodicityText;
 };
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: ""

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:115:7
   weekDays: Array<WeekDays>;
 }): string => {
   let periodicityText = "";
-  if (times) {
+  if (true) {
     if (periodType == PeriodicityType.monthly) {
       periodicityText = t("UI_MONTHLY");
killedBy: getPeriodicityText should return the correct periodicity text for an undefined time period
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "monthly - 0 time"

[Killed] BlockStatement
app/utils/calculation/calculation.ts:116:48
 }): string => {
   let periodicityText = "";
   if (times) {
-    if (periodType == PeriodicityType.monthly) {
-      periodicityText = t("UI_MONTHLY");
-    } else {
+    if (periodType == PeriodicityType.monthly) {} else {
       periodicityText = t("UI_WEEKLY");
     }
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: " - 1 time every Wednesday"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:116:9
 }): string => {
   let periodicityText = "";
   if (times) {
-    if (periodType == PeriodicityType.monthly) {
+    if (false) {
       periodicityText = t("UI_MONTHLY");
     } else {
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "weekly - 1 time every Wednesday"

[Killed] BlockStatement
app/utils/calculation/calculation.ts:118:12
   if (times) {
     if (periodType == PeriodicityType.monthly) {
       periodicityText = t("UI_MONTHLY");
-    } else {
-      periodicityText = t("UI_WEEKLY");
-    }
+    } else {}
     periodicityText = periodicityText + " - ";
 
killedBy: getPeriodicityText should return the correct periodicity text two times, on a weekly basis, on a wednesday and a friday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "weekly - 2 times every Wednesday, Friday"
Received: " - 2 times every Wednesday, Friday"

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:123:9
     }
     periodicityText = periodicityText + " - ";
 
-    if (times > 1) {
+    if (times >= 1) {
       periodicityText = periodicityText + times + " " + t("UI_TIMES");
     } else {
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly - 1 times every Wednesday"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:123:9
     }
     periodicityText = periodicityText + " - ";
 
-    if (times > 1) {
+    if (true) {
       periodicityText = periodicityText + times + " " + t("UI_TIMES");
     } else {
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly - 1 times every Wednesday"

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:124:25
     periodicityText = periodicityText + " - ";
 
     if (times > 1) {
-      periodicityText = periodicityText + times + " " + t("UI_TIMES");
+      periodicityText = periodicityText - times + " " + t("UI_TIMES");
     } else {
       periodicityText = periodicityText + times + " " + t("UI_TIME");
killedBy: getPeriodicityText should return the correct periodicity text two times, on a montly basis, on a wednesday and a friday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 2 times every Wednesday, Friday"
Received: "NaN times every Wednesday, Friday"

[Killed] StringLiteral
app/utils/calculation/calculation.ts:124:51
     periodicityText = periodicityText + " - ";
 
     if (times > 1) {
-      periodicityText = periodicityText + times + " " + t("UI_TIMES");
+      periodicityText = periodicityText + times + "" + t("UI_TIMES");
     } else {
       periodicityText = periodicityText + times + " " + t("UI_TIME");
killedBy: getPeriodicityText should return the correct periodicity text two times, on a montly basis, on a wednesday and a friday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 2 times every Wednesday, Friday"
Received: "monthly - 2times every Wednesday, Friday"
