[Killed] BlockStatement
app/utils/calculation/calculation.ts:125:12
 
     if (times > 1) {
       periodicityText = periodicityText + times + " " + t("UI_TIMES");
-    } else {
-      periodicityText = periodicityText + times + " " + t("UI_TIME");
-    }
+    } else {}
 
     if (weekDays.length) {
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly -  every Wednesday"

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:126:25
     if (times > 1) {
       periodicityText = periodicityText + times + " " + t("UI_TIMES");
     } else {
-      periodicityText = periodicityText + times + " " + t("UI_TIME");
+      periodicityText = periodicityText - times + " " + t("UI_TIME");
     }
 
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "NaN time every Wednesday"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:129:9
       periodicityText = periodicityText + times + " " + t("UI_TIME");
     }
 
-    if (weekDays.length) {
+    if (true) {
       periodicityText = periodicityText + " " + t("UI_EVERY") + " ";
       const daysToDisplay = WEEK_DAYS.filter((item) =>
killedBy: getPeriodicityText should return the correct periodicity text three times, on a weekly basis, on no specific days
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "weekly - 3 times"
Received: "weekly - 3 times every "

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:129:9
       periodicityText = periodicityText + times + " " + t("UI_TIME");
     }
 
-    if (weekDays.length) {
+    if (false) {
       periodicityText = periodicityText + " " + t("UI_EVERY") + " ";
       const daysToDisplay = WEEK_DAYS.filter((item) =>
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly - 1 time"

[Killed] StringLiteral
app/utils/calculation/calculation.ts:130:43
     }
 
     if (weekDays.length) {
-      periodicityText = periodicityText + " " + t("UI_EVERY") + " ";
+      periodicityText = periodicityText + "" + t("UI_EVERY") + " ";
       const daysToDisplay = WEEK_DAYS.filter((item) =>
         weekDays.includes(item.dayIndex)
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly - 1 timeevery Wednesday"

[Killed] ArrowFunction
app/utils/calculation/calculation.ts:131:46
 
     if (weekDays.length) {
       periodicityText = periodicityText + " " + t("UI_EVERY") + " ";
-      const daysToDisplay = WEEK_DAYS.filter((item) =>
-        weekDays.includes(item.dayIndex)
+      const daysToDisplay = WEEK_DAYS.filter(() => undefined
       ).map((item) => t(item.nameKey));
       periodicityText = periodicityText + join(", ", daysToDisplay);
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly - 1 time every "

[Killed] MethodExpression
app/utils/calculation/calculation.ts:131:29
 
     if (weekDays.length) {
       periodicityText = periodicityText + " " + t("UI_EVERY") + " ";
-      const daysToDisplay = WEEK_DAYS.filter((item) =>
-        weekDays.includes(item.dayIndex)
-      ).map((item) => t(item.nameKey));
+      const daysToDisplay = WEEK_DAYS.map((item) => t(item.nameKey));
       periodicityText = periodicityText + join(", ", daysToDisplay);
     }
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly - 1 time every Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday"

[Killed] ArrowFunction
app/utils/calculation/calculation.ts:133:13
       periodicityText = periodicityText + " " + t("UI_EVERY") + " ";
       const daysToDisplay = WEEK_DAYS.filter((item) =>
         weekDays.includes(item.dayIndex)
-      ).map((item) => t(item.nameKey));
+      ).map(() => undefined);
       periodicityText = periodicityText + join(", ", daysToDisplay);
     }
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: "monthly - 1 time every "

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:134:25
       const daysToDisplay = WEEK_DAYS.filter((item) =>
         weekDays.includes(item.dayIndex)
       ).map((item) => t(item.nameKey));
-      periodicityText = periodicityText + join(", ", daysToDisplay);
+      periodicityText = periodicityText - join(", ", daysToDisplay);
     }
   }
killedBy: getPeriodicityText should return the correct periodicity text one time, on a montly basis, on a wednesday
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "monthly - 1 time every Wednesday"
Received: NaN

[Killed] BlockStatement
app/utils/calculation/calculation.ts:144:14
   metricValue: number,
   useMetricUnits: boolean,
   measureType: MeasureType
-): number => {
-  if (useMetricUnits) {
-    return metricValue;
-  } else {
-    if (measureType === MeasureType.mass) {
-      /* kg -> lbs */
-      return metricValue * 2.205;
-    } else { // measureType === MeasureType.length
-      /* km -> miles
-      note: deviates from NMF.earth's standard of using meters as a reference */
-      return metricValue / 1.609;
-    }
-  }
-};
+): number => {};
 
 const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {
killedBy: getImperialMetricValue should return the correct measurement value for a mass value in metric
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.02
Received: undefined

[Killed] BlockStatement
app/utils/calculation/calculation.ts:145:23
   useMetricUnits: boolean,
   measureType: MeasureType
 ): number => {
-  if (useMetricUnits) {
-    return metricValue;
-  } else {
+  if (useMetricUnits) {} else {
     if (measureType === MeasureType.mass) {
       /* kg -> lbs */
killedBy: getImperialMetricValue should return the correct measurement value for a mass value in metric
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.02
Received: undefined

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:145:7
   useMetricUnits: boolean,
   measureType: MeasureType
 ): number => {
-  if (useMetricUnits) {
+  if (true) {
     return metricValue;
   } else {
killedBy: getImperialMetricValue should return the correct measurement value for a mass value in Imperial
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.0441
Received: 0.02

[Killed] BlockStatement
app/utils/calculation/calculation.ts:147:10
 ): number => {
   if (useMetricUnits) {
     return metricValue;
-  } else {
-    if (measureType === MeasureType.mass) {
-      /* kg -> lbs */
-      return metricValue * 2.205;
-    } else { // measureType === MeasureType.length
-      /* km -> miles
-      note: deviates from NMF.earth's standard of using meters as a reference */
-      return metricValue / 1.609;
-    }
-  }
+  } else {}
 };
 
killedBy: getImperialMetricValue should return the correct measurement value for a mass value in Imperial
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.0441
Received: undefined

[Killed] BlockStatement
app/utils/calculation/calculation.ts:148:43
   if (useMetricUnits) {
     return metricValue;
   } else {
-    if (measureType === MeasureType.mass) {
-      /* kg -> lbs */
-      return metricValue * 2.205;
-    } else { // measureType === MeasureType.length
+    if (measureType === MeasureType.mass) {} else { // measureType === MeasureType.length
       /* km -> miles
       note: deviates from NMF.earth's standard of using meters as a reference */
killedBy: getImperialMetricValue should return the correct measurement value for a mass value in Imperial
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.0441
Received: undefined

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:148:9
   if (useMetricUnits) {
     return metricValue;
   } else {
-    if (measureType === MeasureType.mass) {
+    if (true) {
       /* kg -> lbs */
       return metricValue * 2.205;
killedBy: getImperialMetricValue should return the correct measurement value for a length value in Imperial
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.012430080795525171
Received: 0.0441

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:150:14
   } else {
     if (measureType === MeasureType.mass) {
       /* kg -> lbs */
-      return metricValue * 2.205;
+      return metricValue / 2.205;
     } else { // measureType === MeasureType.length
       /* km -> miles
killedBy: getImperialMetricValue should return the correct measurement value for a mass value in Imperial
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.0441
Received: 0.009070294784580499

[Killed] BlockStatement
app/utils/calculation/calculation.ts:151:12
     if (measureType === MeasureType.mass) {
       /* kg -> lbs */
       return metricValue * 2.205;
-    } else { // measureType === MeasureType.length
-      /* km -> miles
-      note: deviates from NMF.earth's standard of using meters as a reference */
-      return metricValue / 1.609;
-    }
+    } else {}
   }
 };
killedBy: getImperialMetricValue should return the correct measurement value for a length value in Imperial
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.012430080795525171
Received: undefined

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:154:14
     } else { // measureType === MeasureType.length
       /* km -> miles
       note: deviates from NMF.earth's standard of using meters as a reference */
-      return metricValue / 1.609;
+      return metricValue * 1.609;
     }
   }
killedBy: getImperialMetricValue should return the correct measurement value for a length value in Imperial
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.012430080795525171
Received: 0.03218

[Killed] BlockStatement
app/utils/calculation/calculation.ts:159:84
   }
 };
 
-const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {
-  if (useMetricUnits) {
-    if (kgValue <= 1) {
-      return kgValue * 1000;
-    } else if ( kgValue <= 1000) {
-      return kgValue;
-    } else {
-      return kgValue / 1000;
-    }
-  } else {
-    if (kgValue <= 0.454) {
-      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) * 16;
-    } else {
-      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass);
-    }
-  }
-};
+const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {};
 
 const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = true): string => {
killedBy: getDisplayUnitsValue should convert the given kilogram value to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: undefined

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:160:7
 };
 
 const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {
-  if (useMetricUnits) {
+  if (false) {
     if (kgValue <= 1) {
       return kgValue * 1000;
killedBy: getDisplayUnitsValue should convert the given kilogram value to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: 0.32

[Killed] BlockStatement
app/utils/calculation/calculation.ts:160:23
 };
 
 const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {
-  if (useMetricUnits) {
-    if (kgValue <= 1) {
-      return kgValue * 1000;
-    } else if ( kgValue <= 1000) {
-      return kgValue;
-    } else {
-      return kgValue / 1000;
-    }
-  } else {
+  if (useMetricUnits) {} else {
     if (kgValue <= 0.454) {
       return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) * 16;
killedBy: getDisplayUnitsValue should convert the given kilogram value to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: undefined

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:161:9
 
 const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {
   if (useMetricUnits) {
-    if (kgValue <= 1) {
+    if (true) {
       return kgValue * 1000;
     } else if ( kgValue <= 1000) {
killedBy: getDisplayUnitsValue should convert the given kilogram value to kilograms
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1.1
Received: 1100

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:161:9
 
 const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {
   if (useMetricUnits) {
-    if (kgValue <= 1) {
+    if (kgValue < 1) {
       return kgValue * 1000;
     } else if ( kgValue <= 1000) {
killedBy: getDisplayUnitsValue should convert the given kilogram value to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1000
Received: 1

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:162:14
 const getDisplayUnitsValue = (kgValue: number, useMetricUnits: boolean): number => {
   if (useMetricUnits) {
     if (kgValue <= 1) {
-      return kgValue * 1000;
+      return kgValue / 1000;
     } else if ( kgValue <= 1000) {
       return kgValue;
killedBy: getDisplayUnitsValue should convert the given kilogram value to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 20
Received: 0.00002

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:163:17
   if (useMetricUnits) {
     if (kgValue <= 1) {
       return kgValue * 1000;
-    } else if ( kgValue <= 1000) {
+    } else if ( false) {
       return kgValue;
     } else {
killedBy: getDisplayUnitsValue should convert the given kilogram value to kilograms
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1.1
Received: 0.0011

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:163:17
   if (useMetricUnits) {
     if (kgValue <= 1) {
       return kgValue * 1000;
-    } else if ( kgValue <= 1000) {
+    } else if ( kgValue < 1000) {
       return kgValue;
     } else {
killedBy: getDisplayUnitsValue should convert the given kilogram value to kilograms
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1000
Received: 1

[Killed] BlockStatement
app/utils/calculation/calculation.ts:165:12
       return kgValue * 1000;
     } else if ( kgValue <= 1000) {
       return kgValue;
-    } else {
-      return kgValue / 1000;
-    }
+    } else {}
   } else {
     if (kgValue <= 0.454) {
killedBy: getDisplayUnitsValue should convert the given kilogram value to tonnes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1.258
Received: undefined

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:166:14
     } else if ( kgValue <= 1000) {
       return kgValue;
     } else {
-      return kgValue / 1000;
+      return kgValue * 1000;
     }
   } else {
killedBy: getDisplayUnitsValue should convert the given kilogram value to tonnes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1.258
Received: 1258000

[Killed] BlockStatement
app/utils/calculation/calculation.ts:168:10
     } else {
       return kgValue / 1000;
     }
-  } else {
-    if (kgValue <= 0.454) {
-      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) * 16;
-    } else {
-      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass);
-    }
-  }
+  } else {}
 };
 
killedBy: getDisplayUnitsValue should convert the given kilogram value to ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.7056
Received: undefined

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:169:9
       return kgValue / 1000;
     }
   } else {
-    if (kgValue <= 0.454) {
+    if (kgValue < 0.454) {
       return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) * 16;
     } else {
killedBy: getDisplayUnitsValue should convert the given kilogram value to ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 16.017120000000002
Received: 1.0010700000000001

[Killed] BlockStatement
app/utils/calculation/calculation.ts:169:27
       return kgValue / 1000;
     }
   } else {
-    if (kgValue <= 0.454) {
-      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) * 16;
-    } else {
+    if (kgValue <= 0.454) {} else {
       return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass);
     }
killedBy: getDisplayUnitsValue should convert the given kilogram value to ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.7056
Received: undefined

[Killed] ArithmeticOperator
app/utils/calculation/calculation.ts:170:14
     }
   } else {
     if (kgValue <= 0.454) {
-      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) * 16;
+      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) / 16;
     } else {
       return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass);
killedBy: getDisplayUnitsValue should convert the given kilogram value to ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.7056
Received: 0.00275625

[Killed] BlockStatement
app/utils/calculation/calculation.ts:171:12
   } else {
     if (kgValue <= 0.454) {
       return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass) * 16;
-    } else {
-      return getImperialMetricValue(kgValue, useMetricUnits, MeasureType.mass);
-    }
+    } else {}
   }
 };
killedBy: getDisplayUnitsValue should convert the given kilogram value to pounds
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1.9845000000000002
Received: undefined

[Killed] BlockStatement
app/utils/calculation/calculation.ts:177:97
   }
 };
 
-const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = true): string => {
-  const suffix = useSymbol ? "_SYMBOL" : "_FULL";
-
-  if (useMetricUnits) {
-    if (kgValue <= 1) {
-      return t(`GRAMS${suffix}`);
-    } else if (kgValue <= 1000) {
-      return t(`KILOGRAMS${suffix}`);
-    } else {
-      return t(`TONNES${suffix}`);
-    }
-  } else {
-    if (kgValue <= 0.454) {
-      return t(`OUNCES${suffix}`);
-    } else {
-      return t(`POUNDS${suffix}`);
-    }
-  }
-};
+const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = true): string => {};
 
 export default {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g"
Received: undefined

[Killed] BooleanLiteral
app/utils/calculation/calculation.ts:177:80
   }
 };
 
-const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = true): string => {
+const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = false): string => {
   const suffix = useSymbol ? "_SYMBOL" : "_FULL";
 
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g"
Received: "gram(s)"

[Killed] StringLiteral
app/utils/calculation/calculation.ts:178:42
 };
 
 const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = true): string => {
-  const suffix = useSymbol ? "_SYMBOL" : "_FULL";
+  const suffix = useSymbol ? "_SYMBOL" : "";
 
   if (useMetricUnits) {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "gram(s)"
Received: "[missing \"mock.GRAMS\" translation]"

[Killed] BlockStatement
app/utils/calculation/calculation.ts:180:23
 const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = true): string => {
   const suffix = useSymbol ? "_SYMBOL" : "_FULL";
 
-  if (useMetricUnits) {
-    if (kgValue <= 1) {
-      return t(`GRAMS${suffix}`);
-    } else if (kgValue <= 1000) {
-      return t(`KILOGRAMS${suffix}`);
-    } else {
-      return t(`TONNES${suffix}`);
-    }
-  } else {
+  if (useMetricUnits) {} else {
     if (kgValue <= 0.454) {
       return t(`OUNCES${suffix}`);
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g"
Received: undefined

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:180:7
 const getDisplayUnits = (kgValue: number, useMetricUnits: boolean, useSymbol = true): string => {
   const suffix = useSymbol ? "_SYMBOL" : "_FULL";
 
-  if (useMetricUnits) {
+  if (false) {
     if (kgValue <= 1) {
       return t(`GRAMS${suffix}`);
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g"
Received: "oz"

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:181:9
   const suffix = useSymbol ? "_SYMBOL" : "_FULL";
 
   if (useMetricUnits) {
-    if (kgValue <= 1) {
+    if (kgValue > 1) {
       return t(`GRAMS${suffix}`);
     } else if (kgValue <= 1000) {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to grams
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g"
Received: "kg"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:183:16
   if (useMetricUnits) {
     if (kgValue <= 1) {
       return t(`GRAMS${suffix}`);
-    } else if (kgValue <= 1000) {
+    } else if (false) {
       return t(`KILOGRAMS${suffix}`);
     } else {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to kilograms
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "kg"
Received: "t"

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:183:16
   if (useMetricUnits) {
     if (kgValue <= 1) {
       return t(`GRAMS${suffix}`);
-    } else if (kgValue <= 1000) {
+    } else if (kgValue > 1000) {
       return t(`KILOGRAMS${suffix}`);
     } else {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to kilograms
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "kg"
Received: "t"

[Killed] BlockStatement
app/utils/calculation/calculation.ts:185:12
       return t(`GRAMS${suffix}`);
     } else if (kgValue <= 1000) {
       return t(`KILOGRAMS${suffix}`);
-    } else {
-      return t(`TONNES${suffix}`);
-    }
+    } else {}
   } else {
     if (kgValue <= 0.454) {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to tonnes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "t"
Received: undefined

[Killed] BlockStatement
app/utils/calculation/calculation.ts:188:10
     } else {
       return t(`TONNES${suffix}`);
     }
-  } else {
-    if (kgValue <= 0.454) {
-      return t(`OUNCES${suffix}`);
-    } else {
-      return t(`POUNDS${suffix}`);
-    }
-  }
+  } else {}
 };
 
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "oz"
Received: undefined

[Killed] EqualityOperator
app/utils/calculation/calculation.ts:189:9
       return t(`TONNES${suffix}`);
     }
   } else {
-    if (kgValue <= 0.454) {
+    if (kgValue > 0.454) {
       return t(`OUNCES${suffix}`);
     } else {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "oz"
Received: "lb"

[Killed] ConditionalExpression
app/utils/calculation/calculation.ts:189:9
       return t(`TONNES${suffix}`);
     }
   } else {
-    if (kgValue <= 0.454) {
+    if (false) {
       return t(`OUNCES${suffix}`);
     } else {
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "oz"
Received: "lb"

[Killed] BlockStatement
app/utils/calculation/calculation.ts:191:12
   } else {
     if (kgValue <= 0.454) {
       return t(`OUNCES${suffix}`);
-    } else {
-      return t(`POUNDS${suffix}`);
-    }
+    } else {}
   }
 };
killedBy: getDisplayUnits should return the correct units given a kilogram value that should be converted to pounds
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "lb"
Received: undefined
