[Timeout] BlockStatement
app/utils/time/time.ts:11:72
   minutes: number;
 }
 
-const convertMinutesToHoursAnMinutes = (minutes: number): TimeProps => {
-  if (isNotValidNumber(minutes)) {
-    return { hours: 0, minutes: 0 };
-  }
-  const hours = Math.floor(minutes / 60);
-  const minutesAboveHours = Math.round(minutes) % 60;
-
-  return { hours: hours, minutes: minutesAboveHours };
-};
+const convertMinutesToHoursAnMinutes = (minutes: number): TimeProps => {};
 
 const getEarlierDate = (date1: Date, date2: Date): Date => (date1 < date2 ? date1 : date2);

[Timeout] ConditionalExpression
app/utils/time/time.ts:12:7
 }
 
 const convertMinutesToHoursAnMinutes = (minutes: number): TimeProps => {
-  if (isNotValidNumber(minutes)) {
+  if (true) {
     return { hours: 0, minutes: 0 };
   }

[Timeout] BlockStatement
app/utils/time/time.ts:12:34
 }
 
 const convertMinutesToHoursAnMinutes = (minutes: number): TimeProps => {
-  if (isNotValidNumber(minutes)) {
-    return { hours: 0, minutes: 0 };
-  }
+  if (isNotValidNumber(minutes)) {}
   const hours = Math.floor(minutes / 60);
   const minutesAboveHours = Math.round(minutes) % 60;

[Timeout] ArithmeticOperator
app/utils/time/time.ts:15:28
   if (isNotValidNumber(minutes)) {
     return { hours: 0, minutes: 0 };
   }
-  const hours = Math.floor(minutes / 60);
+  const hours = Math.floor(minutes * 60);
   const minutesAboveHours = Math.round(minutes) % 60;
 

[Killed] ArithmeticOperator
app/utils/time/time.ts:16:29
     return { hours: 0, minutes: 0 };
   }
   const hours = Math.floor(minutes / 60);
-  const minutesAboveHours = Math.round(minutes) % 60;
+  const minutesAboveHours = Math.round(minutes) * 60;
 
   return { hours: hours, minutes: minutesAboveHours };
killedBy: convertMinutesToHoursAnMinutes should return the correct number of hours and minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "hours": 2,
-   "minutes": 30,

[Killed] ArrowFunction
app/utils/time/time.ts:21:24
   return { hours: hours, minutes: minutesAboveHours };
 };
 
-const getEarlierDate = (date1: Date, date2: Date): Date => (date1 < date2 ? date1 : date2);
+const getEarlierDate = () => undefined;
 
 const getLaterDate = (date1: Date, date2: Date): Date => (date1 > date2 ? date1 : date2);
killedBy: getEarlierTime should return the earlier date object when 2 dates are compared different dates date1 is earlier than date2
statusReason: TypeError: Cannot read properties of undefined (reading 'getTime')

[Killed] ConditionalExpression
app/utils/time/time.ts:21:61
   return { hours: hours, minutes: minutesAboveHours };
 };
 
-const getEarlierDate = (date1: Date, date2: Date): Date => (date1 < date2 ? date1 : date2);
+const getEarlierDate = (date1: Date, date2: Date): Date => (true ? date1 : date2);
 
 const getLaterDate = (date1: Date, date2: Date): Date => (date1 > date2 ? date1 : date2);
killedBy: getEarlierTime should return the earlier date object when 2 dates are compared different dates date2 is earlier than date1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1684774565283
Received: 1684774649359

[Killed] ArrowFunction
app/utils/time/time.ts:23:22
 
 const getEarlierDate = (date1: Date, date2: Date): Date => (date1 < date2 ? date1 : date2);
 
-const getLaterDate = (date1: Date, date2: Date): Date => (date1 > date2 ? date1 : date2);
+const getLaterDate = () => undefined;
 
 export default { convertMinutesToHoursAnMinutes, getEarlierDate, getLaterDate };
killedBy: getLaterTime should return the later date object when 2 dates are compared different dates date1 is later than date2
statusReason: TypeError: Cannot read properties of undefined (reading 'getTime')

[Killed] EqualityOperator
app/utils/time/time.ts:23:59
 
 const getEarlierDate = (date1: Date, date2: Date): Date => (date1 < date2 ? date1 : date2);
 
-const getLaterDate = (date1: Date, date2: Date): Date => (date1 > date2 ? date1 : date2);
+const getLaterDate = (date1: Date, date2: Date): Date => (date1 <= date2 ? date1 : date2);
 
 export default { convertMinutesToHoursAnMinutes, getEarlierDate, getLaterDate };
killedBy: getLaterTime should return the later date object when 2 dates are compared different dates date1 is later than date2
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1684774584959
Received: 1684774578737

[Killed] ObjectLiteral
app/utils/time/time.ts:25:16
 
 const getLaterDate = (date1: Date, date2: Date): Date => (date1 > date2 ? date1 : date2);
 
-export default { convertMinutesToHoursAnMinutes, getEarlierDate, getLaterDate };
+export default {};
 
killedBy: convertMinutesToHoursAnMinutes should return the correct number of hours and minutes
statusReason: TypeError: _.default.convertMinutesToHoursAnMinutes is not a function
